```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.packet_spot_market_request.dreq will be read during apply
  # (config refers to values not yet known)
 <= data "packet_spot_market_request" "dreq"  {
      ~ device_ids = [
          - "16ca2925-33f8-405c-9beb-4cc0b034f8e7",
        ] -> (known after apply)
      ~ id         = "31d34e2e-dcd8-443d-b1e4-1d6842408ae116ca2925-33f8-405c-9beb-4cc0b034f8e7" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + create  = (known after apply)
          + default = (known after apply)
          + delete  = (known after apply)
          + update  = (known after apply)
        }
    }

  # data.packet_spot_market_request.sreq will be read during apply
  # (config refers to values not yet known)
 <= data "packet_spot_market_request" "sreq"  {
      ~ device_ids = [] -> (known after apply)
      ~ id         = "37040490-c767-4265-93e5-b99f390b1a47" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + create  = (known after apply)
          + default = (known after apply)
          + delete  = (known after apply)
          + update  = (known after apply)
        }
    }

  # aws_kms_key.kurl_testgrid_sops_key will be created
  + resource "aws_kms_key" "kurl_testgrid_sops_key" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days  = 7
      + description              = "KMS Key for sops"
      + enable_key_rotation      = false
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = (known after apply)
    }

  # packet_spot_market_request.base-request will be updated in-place
  ~ resource "packet_spot_market_request" "base-request" {
        id            = "31d34e2e-dcd8-443d-b1e4-1d6842408ae1"
        # (5 unchanged attributes hidden)

      ~ instance_parameters {
          + always_pxe        = ""
          + customdata        = ""
          + description       = ""
          + locked            = ""
          + termintation_time = ""
          # Warning: this attribute value will be marked as sensitive and will
          # not display in UI output after applying this change
          ~ userdata          = (sensitive)
            # (7 unchanged attributes hidden)
        }
    }

  # packet_spot_market_request.burst-request will be updated in-place
  ~ resource "packet_spot_market_request" "burst-request" {
        id            = "37040490-c767-4265-93e5-b99f390b1a47"
        # (5 unchanged attributes hidden)

      ~ instance_parameters {
          + always_pxe        = ""
          + customdata        = ""
          + description       = ""
          + locked            = ""
          + termintation_time = ""
          # Warning: this attribute value will be marked as sensitive and will
          # not display in UI output after applying this change
          ~ userdata          = (sensitive)
            # (7 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ burst-ids = [] -> (known after apply)
  ~ ids       = [
      - "16ca2925-33f8-405c-9beb-4cc0b034f8e7",
    ] -> (known after apply)

------------------------------------------------------------------------
```